import pymysql  # 先安装再引入包

# 创建链接数据库

try:
    # 创建链接数据库
    conn = pymysql.connect(host='127.0.0.1', database='student2022', port=3306, user='root', password='root',
                           charset='utf8mb4')
except pymysql.Error as e:
    print('数据库链接失败！', str(e))
else:  # try没有异常的时候才会执行
    print("sucessfully!")
    cur = conn.cursor()
    cur.execute("select * from loginaccount")
    rs = cur.fetchall()
    print(rs)

    cur1 = conn.cursor()
    # 第二个游标

try:

    # 第三种：可以一次插入多条，效率比一条条插高,用的方法是executemany，整个一个班的同学的信息插入进去！！！！！！！！！！！！！！！！！！！！！
    stmt = 'insert into studentinfo(StudentNo,Name) values (%s,%s)'
    data = [
        ('20201103035', '齐家宝'),
        ('20201103036', '阿荣娜'),
        ('20201103037', '亢学良'),
        ('20201103038', '高圆'),
        ('20201103040', '李志敏'),
        ('20202103416', '代红梅'),
        ('20201103041', '苏日娜'),
        ('20201103042', '前德门'),
        ('20201103043', '苏亚'),
        ('20201103044', '包富民'),
        ('20201103045', '希日古'),
        ('20201103046', '高智豪'),
        ('20201103047', '包那日苏'),
        ('20201103048', '木森'),
        ('20201103049', '特日棍'),
        ('20201103050', '伊德龙'),
        ('20201103051', '张荣志'),
        ('20201103052', '德乐黑'),
        ('20201103053', '都兰'),
        ('20201103054', '代乌尼尔'),
        ('20201103055', '白音'),
        ('20201103056', '敖达木'),
        ('20201103057', '阿思亚'),
        ('20201103058', '孟根珠拉'),
        ('20201103059', '阿拉坦干德尔'),
        ('20201103060', '勿日鲁格'),
        ('20201103061', '春燕'),
        ('20201103062', '乌友坛'),
        ('20201103063', '东升'),
        ('20201103064', '柴力干'),
        ('20192104151', '草要乐'),
        ('20192104154', '宝巴雅苏拉')]
    # 列表，元组
    cur1.executemany(stmt, data)


except pymysql.Error as e:
    print('插入数据报错！', str(e))
finally:  # 无论如何都会执行下面的语句
    cur1.close()  # 关闭游标
    conn.commit()
    conn.close()  # 关闭数据库链接
